src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ОграниченияДанныхХарактеристики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОграниченияДанныхХарактеристики</Name>
			<Comment>Ограничения данных характеристики</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
					<Comment>Все данные (не ограничивать)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сроки_Сертификаты</Name>
					<Comment>Сроки хранения и сертификаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомер_Свойства</Name>
					<Comment>Серийные номера и свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свойства</Name>
					<Comment>Свойства характеристики</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категории качества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркированнаяАП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительствоИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПодтверждающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодтверждающиеДокументы</Name>
			<Comment>Данные всех подтверждающих документов по всем объектам</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодтверждающегоДокумента</Name>
					<Comment>Вид подтверждающего документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Comment>Кем выдан подтверждающий документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Comment>Номер бланка подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текущий</Name>
					<Comment>Признак того, что документ актуален в данный момент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Comment>Признак того, что документ устарел и не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоверенности</Name>
					<Comment>Паспорт или др. удостоверение личности для доверенности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, от которого получают материальные ценности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания срока действия подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Comment>Код подразделения в паспорте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алкоголь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Модуль формы элемента справочника "Характеристики номенклатуры"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнениеПоСертификату()
	
	НомерСертификата = Объект.Сертификат.Номер;
	Серия = Объект.Сертификат.Серия;
	ДатаВыдачи = Объект.Сертификат.ДатаВыдачи;
	ДатаОкончания = Объект.Сертификат.ДатаОкончания;
	Выдан = Объект.Сертификат.КемВыдан;
	
КонецПроцедуры

// Формирует наименование по умолчанию.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура СформироватьНаименованиеПоУмолчанию(ПараметрыДействия=Неопределено)
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	ПараметрыВыполнения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыДействия);
	
	Если НЕ ПараметрыВыполнения.Свойство("Форма") Тогда
		
		ПараметрыВыполнения.Вставить("Форма", ЭтотОбъект);
		
	КонецЕсли;
	
	УправлениеДиалогомСервер.СформироватьЗначениеПоУмолчанию(ЭтотОбъект, Объект, ПараметрыВыполнения);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомСправочникаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	Если Не Элементы.Найти("Сертификат")=Неопределено Тогда
		Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.Сертификат.ПараметрыВыбора, "Отбор.Владелец", Объект.Владелец);
		Иначе
			УправлениеДиалогомСервер.УдалитьПараметрВыбора(ЭтотОбъект.Элементы.Сертификат.ПараметрыВыбора, "Отбор.Владелец");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомСправочникаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПараметрОграниченияДанных) Тогда
		Если ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.Все Тогда
			Элементы.ГруппаВсе.Видимость = Истина;
			Элементы.ГруппаЕГАИС.Видимость 				= Ложь;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Ложь;
		ИначеЕсли ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.Сроки_Сертификаты Тогда
			Элементы.ГруппаСроки_Сертификаты.Видимость = Истина;
			Элементы.ГруппаВсе.Видимость = Ложь;
			Элементы.ГруппаЕГАИС.Видимость 				= Ложь;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Ложь;
		ИначеЕсли ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства Тогда
			Элементы.ГруппаСерийныйНомер_Свойства.Видимость = Истина;
			Элементы.ГруппаВсе.Видимость = Ложь;
			Элементы.ГруппаЕГАИС.Видимость 				= Ложь;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Ложь;
		ИначеЕсли ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.Свойства Тогда
			Элементы.ГруппаСвойства.Видимость = Истина;
			Элементы.ГруппаВсе.Видимость = Ложь;
			Элементы.ГруппаЕГАИС.Видимость 				= Ложь;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Ложь;
		ИначеЕсли ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.Качество Тогда
			Элементы.ГруппаКачество.Видимость = Истина;
			Элементы.ГруппаВсе.Видимость = Ложь;
			Элементы.ГруппаЕГАИС.Видимость 				= Ложь;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Ложь;
		ИначеЕсли ПараметрОграниченияДанных = Перечисления.ОграниченияДанныхХарактеристики.МаркированнаяАП Тогда
			Элементы.ГруппаСертификатСроки.Видимость	= Истина;
			Элементы.ГруппаВсе.Видимость 				= Истина;
			Элементы.ГруппаЕГАИС.Видимость 				= Истина;
			Элементы.СтраницаСправки2ЕГАИС.Видимость 	= Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.НомерСроки.Доступность = ФлагНовыйСертификат;
	Элементы.Серия.Доступность = ФлагНовыйСертификат;
	Элементы.ДатаВыдачи.Доступность = ФлагНовыйСертификат;
	Элементы.ДатаОкончания.Доступность = ФлагНовыйСертификат;
	Элементы.Выдан.Доступность = ФлагНовыйСертификат;
	
	Элементы.Сертификат.Доступность = НЕ ФлагНовыйСертификат;
	
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Подключаемый обработчик, вызывающий общую процедуру для обработки команды панели действий.
// 
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата изготовления сроки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДатаИзготовленияСрокиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаИзготовления) Тогда
		Если ЗначениеЗаполнено(СрокХранения) Тогда
			Объект.СрокГодности=НачалоДня(Объект.ДатаИзготовления+СрокХранения*86400);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаИзготовленияСрокиПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок хранения".
&НаКлиенте
Процедура СрокХраненияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаИзготовления) Тогда
		Если ЗначениеЗаполнено(СрокХранения) Тогда
			Объект.СрокГодности = НачалоДня(Объект.ДатаИзготовления+СрокХранения*86400);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СрокХраненияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок годности сроки" в контексте сервера.
&НаСервере
Процедура СрокГодностиСрокиПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // СрокГодностиСрокиПриИзменении(

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок годности сроки".
&НаКлиенте
Процедура СрокГодностиСрокиПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	Если ЗначениеЗаполнено(Объект.СрокГодности) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаИзготовления) Тогда
			Если ЗначениеЗаполнено(СрокХранения) Тогда
				Объект.СрокГодности = Цел((Объект.СрокГодности - НачалоДня(Объект.ДатаИзготовления))/86400);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СрокГодностиСрокиПриИзмененииНаСервере(ПараметрыДействия)
	
КонецПроцедуры // СрокГодностиСрокиПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Серийный номер" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура СерийныйНомерПриИзмененииНаСервере(Знач ПараметрыДействия=Неопределено)
	
	ПараметрыДействия.Вставить("Форма", ЭтотОбъект);
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // СерийныйНомерПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Серийный номер".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СерийныйНомерПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	// Обработаем событие в контексте сервера
	СерийныйНомерПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // СерийныйНомерИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Качество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура КачествоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // КачествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Качество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КачествоПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	// Обработаем событие в контексте сервера
	КачествоПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // КачествоПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Сертификат сроки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СертификатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.Номенклатура") ИЛИ ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Владелец", ?(ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура"), Номенклатура, Объект.Владелец));
		ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ОткрытьФорму("Справочник.ПодтверждающиеДокументы.ФормаВыбора", ПараметрыОткрытия, Элемент);
	КонецЕсли;
	
КонецПроцедуры // СертификатНачалоВыбора()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сертификат" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура СертификатПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // СертификатПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сертификат".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СертификатПриИзмененииНаСервере();
	
КонецПроцедуры // СертификатПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок годности" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура СрокГодностиПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // СрокГодностиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок годности".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СрокГодностиПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	// Обработаем событие в контексте сервера
	СрокГодностиПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // СрокГодностиПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Владелец" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ВладелецПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Обновляет отображаемые данные на форме объекта со свойствами.
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ВладелецПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Владелец".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ВладелецПриИзмененииНаСервере();
	
КонецПроцедуры // ВладелецПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Новый сертификат".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ФлагНовыйСертификатПриИзменении(Элемент)
	
	Если ФлагНовыйСертификат Тогда
		Объект.Сертификат = Неопределено;
		Модифицированность = Истина;
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ФлагНовыйСертификатПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номер строки" в контексте сервера.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура НомерСрокиПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // НомерСрокиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номер сроки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НомерСрокиПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	НомерСрокиПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // НомерСрокиПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Серия" в контексте сервера.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура СерияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // СерияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Серия".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	СерияПриИзмененииНаСервере(ПараметрыДействия)
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Действует до" в контексте сервера.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура ДействуетДоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // ДействуетДоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Действует до".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДействуетДоПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("СертификатНаименование","Сертификат " + Серия+ " № " + НомерСертификата + " до " + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг"));
	
	ДействуетДоПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ДействуетДоПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Категория качества" в контексте сервера.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура КатегорияКачестваПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // КатегорияКачестваПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Категория качества".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КатегорияКачестваПриИзменении(Элемент)
	
	КатегорияКачестваПриИзмененииНаСервере();
	
КонецПроцедуры // КатегорияКачестваПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дополнительные реквизиты" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура Подключаемый_ДополнительныйРеквизитЗначениеПриИзмененииНаСервере(Знач ПараметрыДействия=Неопределено)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("Форма", ЭтотОбъект);
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ДополнительныйРеквизитЗначениеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Дополнительные реквизиты".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ДополнительныйРеквизитЗначениеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	Подключаемый_ДополнительныйРеквизитЗначениеПриИзмененииНаСервере();
	
КонецПроцедуры //Подключаемый_ДополнительныйРеквизитЗначениеПриИзменении()

// Обработчик события возникающего на клиенте при обработке выбора данных реквизита "Наименование".
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбранноеЗначение    - Выбранное значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КэшНаименование = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура Справки2ЕГАИСПриАктивизацииСтроки(Элемент)
	Если Объект.Справки2ЕГАИС.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	ПодключитьОбработчикОжидания( "Подключаемый_Справки2ЕГАИСПриАктивизацииСтроки", 0.5 , Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Справки2ЕГАИСПриАктивизацииСтроки()
	ТекущаяСправка = Элементы.Справки2ЕГАИС.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущаяСправка.Справка2) Тогда 
		Возврат; 
	КонецЕсли;
	ЗаполнитьТаблицуДанныхСправок2(ТекущаяСправка.Справка2);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанныхСправок2(ТекущаяСправка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка КАК Ссылка,
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.НомерСтроки КАК НомерСтроки,
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.ТипМарки КАК ТипМарки,
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.СерияМарки КАК СерияМарки,
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.НачальныйНомер КАК НачальныйНомер,
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.КонечныйНомер КАК КонечныйНомер
	|ИЗ
	|	Справочник.Справки2ЕГАИС.ДиапазоныНомеровАкцизныхМарок КАК Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок
	|ГДЕ
	|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСправка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьСправки2,Выборка);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Если в качестве параметра передан владелец сертификата
	Номенклатура = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Номенклатура", Неопределено);
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Объект.Владелец) Тогда
		ЭтотОбъект.Объект.Владелец = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Владелец", Неопределено);
	КонецЕсли;
	
	ВладелецХарактеристики = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВладелецХарактеристики", Неопределено);
	Если ЗначениеЗаполнено(ВладелецХарактеристики) Тогда
		Объект.Владелец = ВладелецХарактеристики;
		НадоОповеститьОЗаписиНового = Истина;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Устанавливаем дополнительные обработчики на динамические элементы формы
	Для Каждого ПодчиненныйЭлемент Из Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы Цикл
		
		Для Каждого Элемент Из ПодчиненныйЭлемент.ПодчиненныеЭлементы Цикл
			
			// Устанавливаем обработчики событий для элементов дополнительных реквизитов
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныйРеквизитЗначениеПриИзменении");
			
		КонецЦикла;
		
	КонецЦикла;
	
	КопируемаяХарактеристика = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КопируемаяХарактеристика", Неопределено);
	Если ЗначениеЗаполнено(КопируемаяХарактеристика) Тогда
		ЗаполнитьЗначенияСвойств(Объект, КопируемаяХарактеристика,"Владелец, Наименование, ДатаИзготовления, СрокГодности, СерийныйНомер, Сертификат, Качество, Сортировка");
		НадоОповеститьОЗаписиНового = Истина;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.Объект.Владелец = Неопределено Тогда
		Если ТипЗнч(ЭтотОбъект.Объект.Владелец) = Тип("СправочникСсылка.ТипыНоменклатуры") И ЗначениеЗаполнено(ЭтотОбъект.Объект.Владелец.ОграничениеДанныхХарактеристик) Тогда
			ПараметрОграниченияДанных = ЭтотОбъект.Объект.Владелец.ОграничениеДанныхХарактеристик;
		ИначеЕсли ТипЗнч(ЭтотОбъект.Объект.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПараметрОтборНоменклатура = ЭтотОбъект.Объект.Владелец;
			СрокХранения = Объект.Владелец.СрокХраненияТовара;
			Если ЗначениеЗаполнено(ЭтотОбъект.Объект.Владелец.ТипНоменклатуры.ОграничениеДанныхХарактеристик) Тогда
				ПараметрОграниченияДанных = ЭтотОбъект.Объект.Владелец.ТипНоменклатуры.ОграничениеДанныхХарактеристик;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СформироватьНаименованиеПоУмолчанию();
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("Форма", ЭтотОбъект);
	КэшНаименование = Справочники.
						ХарактеристикиНоменклатуры.СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия);
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Сертификат) Тогда
		Если НЕ ЗначениеЗаполнено(ПараметрОтборНоменклатура) Тогда
			Элементы.ФлагНовыйСертификат.Доступность = Ложь;
		КонецЕсли;
	Иначе
		ЗаполнениеПоСертификату();
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево           - Признак отказа от создания формы.
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ФлагНовыйСертификат Тогда
		Если НЕ ЗначениеЗаполнено(НомерСертификата)ИЛИ НЕ ЗначениеЗаполнено(Серия) ИЛИ НЕ ЗначениеЗаполнено(ДатаВыдачи)Тогда
			ВывестиСообщение(НСтр("ru = 'Не указаны реквизиты нового сертификата.'"),ЭтотОбъект,,,Отказ);
			Возврат;
		КонецЕсли;
		Попытка
			НовыйСертификат = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
			НовыйСертификат.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Сертификат;
			НовыйСертификат.Владелец = ПараметрОтборНоменклатура;
			НовыйСертификат.Номер = НомерСертификата;
			НовыйСертификат.Серия = Серия;
			НовыйСертификат.ДатаВыдачи = ДатаВыдачи;
			НовыйСертификат.ДатаОкончания = ДатаОкончания;
			НовыйСертификат.КемВыдан = Выдан;
			НовыйСертификат.Наименование = Справочники.ПодтверждающиеДокументы.СформироватьНаименованиеПоУмолчанию(НовыйСертификат);
			НовыйСертификат.Записать();
			ТекущийОбъект.Сертификат = НовыйСертификат.Ссылка;
			ФлагНовыйСертификат = Ложь;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВывестиСообщение(НСтр("ru = 'Ошибка создания сертификата.'"), ЭтотОбъект,,, Отказ, Символы.ПС, ТекстОшибки);
			Возврат;
		КонецПопытки;
	КонецЕсли;
		
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	   	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если НадоОповеститьОЗаписиНового Тогда
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
